// Написать программу перевода числа из одной системы счисления в другую.
// вариант 7
// аргумент: десятичная строка 
// результат: двоично-десятичное число

// программа перевода из десятичной строки в двоично-десятичное число на ассемблере

{$asmmode intel}
{$output format asw}
var S: word;
var X: string;

begin
X:= ''; S:= 0;
readln(X);
asm

    xor ecx, ecx
    xor eax, eax
	
	// чтобы получить продолжение, напишите на почту pi4vikont.2@gmail.com
	// или в вк vk.com/vikontich
	// я найду чем помочь ;)
			  
end;
writeln();
writeln(S);
readln();
end.

